mkj/imxrt-pacs/svd/MIMXRT1061.svd
        <register>
          <name>INT_MASK</name>
          <description>Mask Register</description>
          <addressOffset>0xA8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HW_ERR</name>
              <description>Bit position that can be cleared or set to enable the corresponding bit of INT_STATUS to show interupt status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HW_ERR_MASKED</name>
                  <description>Corresponding interrupt of INT_STATUS is masked.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HW_ERR_ACTIVE</name>
                  <description>Corresponding bit of INT_STATUS is active.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENT_VAL</name>
              <description>Same behavior as bit 0 of this register.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENT_VAL_MASKED</name>
                  <description>Same behavior as bit 0 of this register.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENT_VAL_ACTIVE</name>
                  <description>Same behavior as bit 0 of this register.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRQ_CT_FAIL</name>
              <description>Same behavior as bit 0 of this register.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FRQ_CT_FAIL_MASKED</name>
                  <description>Same behavior as bit 0 of this register.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRQ_CT_FAIL_ACTIVE</name>
                  <description>Same behavior as bit 0 of this register.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_STATUS</name>
          <description>Interrupt Status Register</description>
          <addressOffset>0xAC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HW_ERR</name>
              <description>Read: Error status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HW_ERR_NO</name>
                  <description>no error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HW_ERR_YES</name>
                  <description>error detected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENT_VAL</name>
              <description>Read only: Entropy Valid</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENT_VAL_INVALID</name>
                  <description>Busy generation entropy. Any value read is invalid.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENT_VAL_VALID</name>
                  <description>TRNG can be stopped and entropy is valid if read.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRQ_CT_FAIL</name>
              <description>Read only: Frequency Count Fail</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FRQ_CT_FAIL_NO_ERR</name>
                  <description>No hardware nor self test frequency errors.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRQ_CT_FAIL_ERR</name>
                  <description>The frequency counter has detected a failure.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>VID1</name>
          <description>Version ID Register (MS)</description>
          <addressOffset>0xF0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x300301</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MIN_REV</name>
              <description>Shows the IP's Minor revision of the TRNG.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MIN_REV_VAL</name>
                  <description>Minor revision number for TRNG.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MAJ_REV</name>
              <description>Shows the IP's Major revision of the TRNG.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAJ_REV_VAL</name>
                  <description>Major revision number for TRNG.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IP_ID</name>
              <description>Shows the IP ID.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IP_ID_VAL</name>
                  <description>ID for TRNG.</description>
                  <value>0x30</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>VID2</name>
          <description>Version ID Register (LS)</description>
          <addressOffset>0xF4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CONFIG_OPT</name>
              <description>Shows the IP's Configuaration options for the TRNG.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CONFIG_OPT_VAL</name>
                  <description>TRNG_CONFIG_OPT for TRNG.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ECO_REV</name>
              <description>Shows the IP's ECO revision of the TRNG.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ECO_REV_VAL</name>
                  <description>TRNG_ECO_REV for TRNG.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INTG_OPT</name>
              <description>Shows the integration options for the TRNG</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTG_OPT_VAL</name>
                  <description>INTG_OPT for TRNG.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ERA</name>
              <description>Shows the compile options for the TRNG.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ERA_VAL</name>
                  <description>COMPILE_OPT for TRNG.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
