mkj/imxrt-pacs/svd/MIMXRT1061.svd
        <register>
          <name>USB2_CHRG_DETECT_STAT</name>
          <description>USB Charger Detect Status Register</description>
          <addressOffset>0x230</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PLUG_CONTACT</name>
              <description>State of the USB plug contact detector.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_CONTACT</name>
                  <description>The USB plug has not made contact.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GOOD_CONTACT</name>
                  <description>The USB plug has made good contact.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHRG_DETECTED</name>
              <description>State of charger detection. This bit is a read only version of the state of the analog signal.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CHARGER_NOT_PRESENT</name>
                  <description>The USB port is not connected to a charger.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHARGER_PRESENT</name>
                  <description>A charger (either a dedicated charger or a host charger) is connected to the USB port.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DM_STATE</name>
              <description>DM line state output of the charger detector.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DP_STATE</name>
              <description>DP line state output of the charger detector.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB2_LOOPBACK</name>
          <description>USB Loopback Test Register</description>
          <addressOffset>0x240</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>UTMI_TESTSTART</name>
              <description>Setting this bit can enable 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB2_LOOPBACK_SET</name>
          <description>USB Loopback Test Register</description>
          <addressOffset>0x244</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>UTMI_TESTSTART</name>
              <description>Setting this bit can enable 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB2_LOOPBACK_CLR</name>
          <description>USB Loopback Test Register</description>
          <addressOffset>0x248</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>UTMI_TESTSTART</name>
              <description>Setting this bit can enable 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB2_LOOPBACK_TOG</name>
          <description>USB Loopback Test Register</description>
          <addressOffset>0x24C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>UTMI_TESTSTART</name>
              <description>Setting this bit can enable 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB2_MISC</name>
          <description>USB Misc Register</description>
          <addressOffset>0x250</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HS_USE_EXTERNAL_R</name>
              <description>Use external resistor to generate the current bias for the high speed transmitter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_DEGLITCH</name>
              <description>Enable the deglitching circuit of the USB PLL output.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_CLK_UTMI</name>
              <description>Enables the clk to the UTMI block.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB2_MISC_SET</name>
          <description>USB Misc Register</description>
          <addressOffset>0x254</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HS_USE_EXTERNAL_R</name>
              <description>Use external resistor to generate the current bias for the high speed transmitter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_DEGLITCH</name>
              <description>Enable the deglitching circuit of the USB PLL output.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_CLK_UTMI</name>
              <description>Enables the clk to the UTMI block.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB2_MISC_CLR</name>
          <description>USB Misc Register</description>
          <addressOffset>0x258</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HS_USE_EXTERNAL_R</name>
              <description>Use external resistor to generate the current bias for the high speed transmitter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_DEGLITCH</name>
              <description>Enable the deglitching circuit of the USB PLL output.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_CLK_UTMI</name>
              <description>Enables the clk to the UTMI block.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB2_MISC_TOG</name>
          <description>USB Misc Register</description>
          <addressOffset>0x25C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HS_USE_EXTERNAL_R</name>
              <description>Use external resistor to generate the current bias for the high speed transmitter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_DEGLITCH</name>
              <description>Enable the deglitching circuit of the USB PLL output.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_CLK_UTMI</name>
              <description>Enables the clk to the UTMI block.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIGPROG</name>
          <description>Chip Silicon Version</description>
          <addressOffset>0x260</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x6C0000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SILICON_REVISION</name>
              <description>Chip silicon revision</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SILICON_REVISION_7077888</name>
                  <description>Silicon revision 1.0</description>
                  <value>0x6C0000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
