mkj/imxrt-pacs/svd/MIMXRT1061.svd
        <register>
          <name>PRES_STATE</name>
          <description>Present State</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x8080</resetValue>
          <resetMask>0x7EFFFF</resetMask>
          <fields>
            <field>
              <name>CIHB</name>
              <description>Command inhibit (CMD)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CIHB_a</name>
                  <description>Can issue command using only CMD line</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CIHB_b</name>
                  <description>Cannot issue command</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CDIHB</name>
              <description>Command Inhibit Data (DATA)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CDIHB_b</name>
                  <description>Can issue command that uses the DATA line</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDIHB_A</name>
                  <description>Cannot issue command that uses the DATA line</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DLA</name>
              <description>Data line active</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DLA_A</name>
                  <description>DATA line inactive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLA_b</name>
                  <description>DATA line active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SDSTB</name>
              <description>SD clock stable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SDSTB_b</name>
                  <description>Clock is changing frequency and not stable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SDSTB_A</name>
                  <description>Clock is stable.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IPGOFF</name>
              <description>Peripheral clock gated off internally</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IPGOFF_b</name>
                  <description>Peripheral clock is active.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IPGOFF_A</name>
                  <description>Peripheral clock is gated off.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HCKOFF</name>
              <description>HCLK gated off internally</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HCKOFF_B</name>
                  <description>HCLK is active.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HCKOFF_A</name>
                  <description>HCLK is gated off.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PEROFF</name>
              <description>IPG_PERCLK gated off internally</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PEROFF_b</name>
                  <description>IPG_PERCLK is active.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PEROFF_A</name>
                  <description>IPG_PERCLK is gated off.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SDOFF</name>
              <description>SD clock gated off internally</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SDOFF_D</name>
                  <description>SD clock is active.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SDOFF_C</name>
                  <description>SD clock is gated off.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WTA</name>
              <description>Write transfer active</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WTA_B</name>
                  <description>No valid data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WTA_A</name>
                  <description>Transferring data</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTA</name>
              <description>Read transfer active</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RTA_B</name>
                  <description>No valid data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTA_A</name>
                  <description>Transferring data</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BWEN</name>
              <description>Buffer write enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BWEN_b</name>
                  <description>Write disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BWEN_A</name>
                  <description>Write enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BREN</name>
              <description>Buffer read enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BREN_B</name>
                  <description>Read disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BREN_A</name>
                  <description>Read enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTR</name>
              <description>Re-Tuning Request (only for SD3.0 SDR104 mode,and eMMC HS200 mode)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RTR_B</name>
                  <description>Fixed or well tuned sampling clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTR_A</name>
                  <description>Sampling clock needs re-tuning</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSCD</name>
              <description>Tap select change done</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TSCD_B</name>
                  <description>Delay cell select change is not finished.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSCD_A</name>
                  <description>Delay cell select change is finished.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CINST</name>
              <description>Card inserted</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CINST_a</name>
                  <description>Power on reset or no card</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CINST_B</name>
                  <description>Card inserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLSL</name>
              <description>CMD line signal level</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DLSL</name>
              <description>DATA[7:0] line signal level</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DATA0</name>
                  <description>Data 0 line signal level</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATA1</name>
                  <description>Data 1 line signal level</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATA2</name>
                  <description>Data 2 line signal level</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATA3</name>
                  <description>Data 3 line signal level</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATA4</name>
                  <description>Data 4 line signal level</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATA5</name>
                  <description>Data 5 line signal level</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATA6</name>
                  <description>Data 6 line signal level</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATA7</name>
                  <description>Data 7 line signal level</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
