mkj/imxrt-pacs/svd/MIMXRT1061.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SPDIF</name>
      <description>SPDIF</description>
      <groupName>SPDIF</groupName>
      <baseAddress>0x40380000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x54</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>SPDIF</name>
        <value>60</value>
      </interrupt>
      <registers>
        <register>
          <name>SCR</name>
          <description>SPDIF Configuration Register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x400</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USrc_Sel</name>
              <description>USrc_Sel</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>none</name>
                  <description>No embedded U channel</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>spdif_rxblock</name>
                  <description>U channel from SPDIF receive block (CD mode)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>chip_transmit</name>
                  <description>U channel from on chip transmitter</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TxSel</name>
              <description>TxSel</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>off_out0</name>
                  <description>Off and output 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>feedthru</name>
                  <description>Feed-through SPDIFIN</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>normal_op</name>
                  <description>Tx Normal operation</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ValCtrl</name>
              <description>ValCtrl</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>always_set</name>
                  <description>Outgoing Validity always set</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>always_clear</name>
                  <description>Outgoing Validity always clear</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>InputSrcSel</name>
              <description>InputSrcSel</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>spdif_in</name>
                  <description>SPDIF_IN</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>none_sel_1</name>
                  <description>None</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>none_sel_2</name>
                  <description>None</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>none_sel_3</name>
                  <description>None</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA_TX_En</name>
              <description>DMA_TX_En</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_Rx_En</name>
              <description>DMA_Rx_En</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TxFIFO_Ctrl</name>
              <description>TxFIFO_Ctrl</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>send_zero</name>
                  <description>Send out digital zero on SPDIF Tx</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>normal</name>
                  <description>Tx Normal operation</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>reset_one</name>
                  <description>Reset to 1 sample remaining</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>soft_reset</name>
              <description>soft_reset</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOW_POWER</name>
              <description>LOW_POWER</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TxFIFOEmpty_Sel</name>
              <description>TxFIFOEmpty_Sel</description>
              <bitOffset>15</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>empty_int_0</name>
                  <description>Empty interrupt if 0 sample in Tx left and right FIFOs</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>empty_int_4</name>
                  <description>Empty interrupt if at most 4 sample in Tx left and right FIFOs</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>empty_int_8</name>
                  <description>Empty interrupt if at most 8 sample in Tx left and right FIFOs</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>empty_int_12</name>
                  <description>Empty interrupt if at most 12 sample in Tx left and right FIFOs</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TxAutoSync</name>
              <description>TxAutoSync</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>off</name>
                  <description>Tx FIFO auto sync off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>on</name>
                  <description>Tx FIFO auto sync on</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RxAutoSync</name>
              <description>RxAutoSync</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>off</name>
                  <description>Rx FIFO auto sync off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>on</name>
                  <description>RxFIFO auto sync on</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RxFIFOFull_Sel</name>
              <description>RxFIFOFull_Sel</description>
              <bitOffset>19</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>full_int_1</name>
                  <description>Full interrupt if at least 1 sample in Rx left and right FIFOs</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>full_int_4</name>
                  <description>Full interrupt if at least 4 sample in Rx left and right FIFOs</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>full_int_8</name>
                  <description>Full interrupt if at least 8 sample in Rx left and right FIFOs</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>full_int_16</name>
                  <description>Full interrupt if at least 16 sample in Rx left and right FIFO</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RxFIFO_Rst</name>
              <description>RxFIFO_Rst</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>normal</name>
                  <description>Normal operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>reset_one</name>
                  <description>Reset register to 1 sample remaining</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RxFIFO_Off_On</name>
              <description>RxFIFO_Off_On</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>on_0</name>
                  <description>SPDIF Rx FIFO is on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>off_1</name>
                  <description>SPDIF Rx FIFO is off. Does not accept data from interface</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RxFIFO_Ctrl</name>
              <description>RxFIFO_Ctrl</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>normal</name>
                  <description>Normal operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>always_zero</name>
                  <description>Always read zero from Rx data register</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCD</name>
          <description>CDText Control Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USyncMode</name>
              <description>USyncMode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>non_cddata</name>
                  <description>Non-CD data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>cduser_chsubcode</name>
                  <description>CD user channel subcode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SRPC</name>
          <description>PhaseConfig Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GainSel</name>
              <description>GainSel</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>gainsel_0b000</name>
                  <description>24*(2**10)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>gainsel_0b001</name>
                  <description>16*(2**10)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>gainsel_0b010</name>
                  <description>12*(2**10)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>gainsel_0b011</name>
                  <description>8*(2**10)</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>gainsel_0b100</name>
                  <description>6*(2**10)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>gainsel_0b101</name>
                  <description>4*(2**10)</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>gainsel_0b110</name>
                  <description>3*(2**10)</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK</name>
              <description>LOCK</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ClkSrc_Sel</name>
              <description>ClkSrc_Sel</description>
              <bitOffset>7</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>clksrc_0b0000</name>
                  <description>if (DPLL Locked) SPDIF_RxClk else REF_CLK_32K (XTALOSC)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clksrc_0b0001</name>
                  <description>if (DPLL Locked) SPDIF_RxClk else tx_clk (SPDIF0_CLK_ROOT)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clksrc_0b0011</name>
                  <description>if (DPLL Locked) SPDIF_RxClk else SPDIF_EXT_CLK</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clksrc_0b0101</name>
                  <description>REF_CLK_32K (XTALOSC)</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clksrc_0b0110</name>
                  <description>tx_clk (SPDIF0_CLK_ROOT)</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clksrc_0b1000</name>
                  <description>SPDIF_EXT_CLK</description>
                  <value>0x8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SIE</name>
          <description>InterruptEn Register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RxFIFOFul</name>
              <description>RxFIFOFul</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TxEm</name>
              <description>TxEm</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LockLoss</name>
              <description>LockLoss</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RxFIFOResyn</name>
              <description>RxFIFOResyn</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RxFIFOUnOv</name>
              <description>RxFIFOUnOv</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UQErr</name>
              <description>UQErr</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UQSync</name>
              <description>UQSync</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>QRxOv</name>
              <description>QRxOv</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>QRxFul</name>
              <description>QRxFul</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>URxOv</name>
              <description>URxOv</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>URxFul</name>
              <description>URxFul</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BitErr</name>
              <description>BitErr</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SymErr</name>
              <description>SymErr</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ValNoGood</name>
              <description>ValNoGood</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNew</name>
              <description>CNew</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TxResyn</name>
              <description>TxResyn</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TxUnOv</name>
              <description>TxUnOv</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Lock</name>
              <description>Lock</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
