mkj/imxrt-pacs/svd/MIMXRT1061.svd
        <register>
          <name>TRIG2_CHAIN_7_6</name>
          <description>ETC_TRIG Chain 6/7 Register</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CSEL6</name>
              <description>ADC channel selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CSEL6_0</name>
                  <description>ADC Channel 0 selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL6_1</name>
                  <description>ADC Channel 1 selected.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL6_2</name>
                  <description>ADC Channel 2 selected.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL6_3</name>
                  <description>ADC Channel 3 selected.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL6_4</name>
                  <description>ADC Channel 4 selected.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL6_5</name>
                  <description>ADC Channel 5 selected.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL6_6</name>
                  <description>ADC Channel 6 selected.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL6_7</name>
                  <description>ADC Channel 7 selected.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL6_8</name>
                  <description>ADC Channel 8 selected.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL6_9</name>
                  <description>ADC Channel 9 selected.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL6_10</name>
                  <description>ADC Channel 10 selected.</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL6_11</name>
                  <description>ADC Channel 11 selected.</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL6_12</name>
                  <description>ADC Channel 12 selected.</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL6_13</name>
                  <description>ADC Channel 13 selected.</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL6_14</name>
                  <description>ADC Channel 14 selected.</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL6_15</name>
                  <description>ADC Channel 15 selected.</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HWTS6</name>
              <description>Segment 6 HWTS ADC hardware trigger selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HWTS6_0</name>
                  <description>no trigger selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWTS6_1</name>
                  <description>ADC TRIG0 selected</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWTS6_2</name>
                  <description>ADC TRIG1 selected</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWTS6_4</name>
                  <description>ADC TRIG2 selected</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWTS6_8</name>
                  <description>ADC TRIG3 selected</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWTS6_16</name>
                  <description>ADC TRIG4 selected</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWTS6_32</name>
                  <description>ADC TRIG5 selected</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWTS6_64</name>
                  <description>ADC TRIG6 selected</description>
                  <value>0x40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWTS6_128</name>
                  <description>ADC TRIG7 selected</description>
                  <value>0x80</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>B2B6</name>
              <description>Segment 6 B2B</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B2B6_0</name>
                  <description>Disable B2B. Wait until delay value defined by TRIG6_COUNTER[SAMPLE_INTERVAL] is reached</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B2B6_1</name>
                  <description>Enable B2B. When Segment 0 finished (ADC COCO) then automatically trigger next ADC conversion, no need to wait until interval delay reached.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IE6</name>
              <description>Segment 6 done interrupt selection</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IE6_0</name>
                  <description>No interrupt when finished</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IE6_1</name>
                  <description>Generate interrupt on Done0 when segment 6 finish.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IE6_2</name>
                  <description>Generate interrupt on Done1 when segment 6 finish.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IE6_3</name>
                  <description>Generate interrupt on Done2 when segment 6 finish.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CSEL7</name>
              <description>ADC channel selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CSEL7_0</name>
                  <description>ADC Channel 0 selected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL7_1</name>
                  <description>ADC Channel 1 selected.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL7_2</name>
                  <description>ADC Channel 2 selected.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL7_3</name>
                  <description>ADC Channel 3 selected.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL7_4</name>
                  <description>ADC Channel 4 selected.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL7_5</name>
                  <description>ADC Channel 5 selected.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL7_6</name>
                  <description>ADC Channel 6 selected.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL7_7</name>
                  <description>ADC Channel 7 selected.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL7_8</name>
                  <description>ADC Channel 8 selected.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL7_9</name>
                  <description>ADC Channel 9 selected.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL7_10</name>
                  <description>ADC Channel 10 selected.</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL7_11</name>
                  <description>ADC Channel 11 selected.</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL7_12</name>
                  <description>ADC Channel 12 selected.</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL7_13</name>
                  <description>ADC Channel 13 selected.</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL7_14</name>
                  <description>ADC Channel 14 selected.</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL7_15</name>
                  <description>ADC Channel 15 selected.</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HWTS7</name>
              <description>Segment 7 HWTS ADC hardware trigger selection</description>
              <bitOffset>20</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HWTS7_0</name>
                  <description>no trigger selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWTS7_1</name>
                  <description>ADC TRIG0 selected</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWTS7_2</name>
                  <description>ADC TRIG1 selected</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWTS7_4</name>
                  <description>ADC TRIG2 selected</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWTS7_8</name>
                  <description>ADC TRIG3 selected</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWTS7_16</name>
                  <description>ADC TRIG4 selected</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWTS7_32</name>
                  <description>ADC TRIG5 selected</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWTS7_64</name>
                  <description>ADC TRIG6 selected</description>
                  <value>0x40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWTS7_128</name>
                  <description>ADC TRIG7 selected</description>
                  <value>0x80</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>B2B7</name>
              <description>Segment 7 B2B</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B2B7_0</name>
                  <description>Disable B2B. Wait until delay value defined by TRIG7_COUNTER[SAMPLE_INTERVAL] is reached</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B2B7_1</name>
                  <description>Enable B2B. When Segment 0 finished (ADC COCO) then automatically trigger next ADC conversion, no need to wait until interval delay reached.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IE7</name>
              <description>Segment 7 done interrupt selection</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IE7_0</name>
                  <description>No interrupt when finished</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IE7_1</name>
                  <description>Generate interrupt on Done0 when segment 7 finish.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IE7_2</name>
                  <description>Generate interrupt on Done1 when segment 7 finish.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IE7_3</name>
                  <description>Generate interrupt on Done2 when segment 7 finish.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TRIG2_RESULT_1_0</name>
          <description>ETC_TRIG Result Data 1/0 Register</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA0</name>
              <description>Result DATA0The sign bit from ADC result FIFO is ignored by ETC_TRIG result, so only 12-bit unsigned results is supported by ADC_ETC module</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DATA1</name>
              <description>Result DATA1The sign bit from ADC result FIFO is ignored by ETC_TRIG result, so only 12-bit unsigned results is supported by ADC_ETC module</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRIG2_RESULT_3_2</name>
          <description>ETC_TRIG Result Data 3/2 Register</description>
          <addressOffset>0x7C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA2</name>
              <description>Result DATA2The sign bit from ADC result FIFO is ignored by ETC_TRIG result, so only 12-bit unsigned results is supported by ADC_ETC module</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DATA3</name>
              <description>Result DATA3The sign bit from ADC result FIFO is ignored by ETC_TRIG result, so only 12-bit unsigned results is supported by ADC_ETC module</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRIG2_RESULT_5_4</name>
          <description>ETC_TRIG Result Data 5/4 Register</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA4</name>
              <description>Result DATA4The sign bit from ADC result FIFO is ignored by ETC_TRIG result, so only 12-bit unsigned results is supported by ADC_ETC module</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DATA5</name>
              <description>Result DATA5The sign bit from ADC result FIFO is ignored by ETC_TRIG result, so only 12-bit unsigned results is supported by ADC_ETC module</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRIG2_RESULT_7_6</name>
          <description>ETC_TRIG Result Data 7/6 Register</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA6</name>
              <description>Result DATA6The sign bit from ADC result FIFO is ignored by ETC_TRIG result, so only 12-bit unsigned results is supported by ADC_ETC module</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DATA7</name>
              <description>Result DATA7The sign bit from ADC result FIFO is ignored by ETC_TRIG result, so only 12-bit unsigned results is supported by ADC_ETC module</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
